ckmx-zkp/My_4inch_LVGL/sdkconfig.defaults
# Build target
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash: 8MB ----
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# ---- PSRAM (octal SPIRAM on ESP32-S3-WROOM-1 N16R8) ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# ---- CPU 240MHz ----
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ---- SoftAP not needed (station only) ----
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# ---- Larger main task stack for LVGL setup ----
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ---- LVGL: use color depth 16, swap for RGB panel off ----
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_PERF_MONITOR=n
